{
  "changes": {
    "1.2": [
      "[Fixed] Testing",
    ],
    "1.1": [
      "[Fixed] Bugfix for background checks not being aware of missing repositories - #5282",
      "[Fixed] Check the local state of a repository before performing Git operations - #5289",
      "[Fixed] Switch to history view for default branch when deleting current branch during a compare - #5256",
      "[Fixed] Handle missing .git directory inside a tracked repository - #5291"
    ],
    "1.0": [
      "[Added] Option to move repository to trash when removing from app - #2108. Thanks @say25!",
      "[Fixed] Markdown header elements hard to read in dark mode - #5133. Thanks @agisilaos!",
      "[Improved] Diff gutter elements should be considered button elements when interacting - #5158"
    ],
    "0.9": [
      "[New] Prompt user to login when authentication error occurs - #903",
      "[New] Windows application has a new app menu, replaces previous hamburger menu - #991",
      "[New] Refreshed colours to align with GitHub website scheme -  #1077",
      "[New] Custom about dialog on all platforms - #1102",
      "[Fixed] Improved error handling when probing for a GitHub Enterprise server - #1026",
      "[Fixed] User can cancel 2FA flow - #1057",
      "[Fixed] Tidy up current set of menu items - #1063",
      "[Fixed] Manually focus the window when a URL action has been received - #1072",
      "[Fixed] Disable middle-click event to prevent new windows being launched - #1074",
      "[Fixed] Pre-fill the account name in the Welcome wizard, not login - #1078",
      "[Fixed] Diffs wouldn't work if an external diff program was configured - #1123",
      "[Improved] Lots of design polish work - #1113, #1099, #1094, #1077"
    ],
    "0.8": [
      "[New] Notification displayed in History tab when the base branch moves ahead of the current branch - #4768",
      "[New] Repository list displays uncommitted changes indicator and ahead/behind information - #2259 #5095",
      "[Added] Option to move repository to trash when removing from app - #2108. Thanks @say25!",
      "[Added] Syntax highlighting for PowerShell files - #5081. Thanks @say25!",
      "[Fixed] \"Discard Changes\" context menu discards correct file when entry is not part of selected group - #4788",
      "[Fixed] Display local path of selected repository as tooltip - #4922. Thanks @yongdamsh!",
      "[Fixed] Display root directory name when repository is located at drive root - #4924",
      "[Fixed] Handle legacy macOS right click gesture - #4942",
      "[Fixed] History omits latest commit from list - #5243",
      "[Fixed] Markdown header elements hard to read in dark mode - #5133. Thanks @agisilaos!",
      "[Fixed] Only perform ahead/behind comparisons when branch selector is open - #5142",
      "[Fixed] Relax checks for merge commits for GitHub Enterprise repositories - #4329",
      "[Fixed] Render clickable link in \"squash and merge\" commit message - #5203. Thanks @1pete!",
      "[Fixed] Return key disabled when no matches found in Compare branch list - #4458",
      "[Fixed] Selected commit not remembered when switching between History and Changes tabs - #4985",
      "[Fixed] Selected commit when comparing is reset to latest when Desktop regains focus - #5069",
      "[Fixed] Support default branch detection for non-GitHub repositories - #4937",
      "[Improved] Change primary button color to blue for dark theme - #5074",
      "[Improved] Diff gutter elements should be considered button elements when interacting - #5158",
      "[Improved] Status parsing significantly more performant when handling thousands of changed files - #2449 #5186"
    ],
    "0.70": [
      "[Removed] Breaking change to the API.",
      "[Added] GraphQL API routes."
    ],
    "0.65": [
      "[Improved] Releases are now tracked granularly."
    ],
    "0.6": [
      "[Fixed] 🐛 Database errors and all sorts."
    ],
    "0.55": [
      "[Fixed] Webhook signature validation."
    ],
    "0.4": [
      "[Added] Added the changelog!"
    ]
  }
}
